In [42]:
#Import dependencis 
import pandas as pd
import matplotlib.pyplot as plt
import sqlalchemy
from sqlalchemy import create_engine, func
import psycopg2

In [43]:
#create SQL Engine
user = "postgres"
#insert your password into this variable.
pw = "postgres"
engine = create_engine(f"postgresql://{user}:{pw}@localhost:5432/Pewlett_Hackard")
conn = engine.connect()

In [44]:
#NOTE: For reading purposes, I put it into multiple rows. 
#SQL statement
sql = "SELECT e.emp_no, s.salary " 
sql = sql + "FROM employees AS e "
sql = sql + "JOIN salaries AS s ON " 
sql = sql + "e.emp_no = s.emp_no "
sql = sql + "GROUP BY 1, 2 "
sql = sql + "ORDER BY 2 DESC;"

#This will execute the SQL statement above
emp_data = pd.read_sql(sql,conn)

emp_df = pd.DataFrame(emp_data)

emp_df.describe()

              emp_no         salary
count  300024.000000  300024.000000
mean   253321.763392   52970.732451
std    161828.235540   14301.478491
min     10001.000000   40000.000000
25%     85006.750000   40000.000000
50%    249987.500000   48681.000000
75%    424993.250000   61758.000000
max    499999.000000  129492.000000

In [45]:
#Create bin, for employee salaries
salary_bin = ['0 to 40k','41k to 70k','71k to 100k','101k to 120k','121k +']

#Adding the bin to the employees Dataframe
emp_df['bin'] = pd.cut(emp_df.salary,5,labels=salary_bin)

In [52]:
#Create groupby dataframe
emp_group = emp_df.groupby('bin')

salary_df = pd.DataFrame(emp_group['salary'].count())

salary_df

              salary
bin
0 to 40k      205522
41k to 70k     68411
71k to 100k    22774
101k to 120k    3156
121k +           161

In [ ]:
#Create histogram for salary ranges

In [54]:
#Average Salary by Title from Pewlett_Hackard Database
sql_2 = 'SELECT t.title, ROUND(AVG(s.salary),2) AS "average salary"'
sql_2 = sql_2 + 'FROM titles AS t '
sql_2 = sql_2 + 'INNER JOIN salaries AS s ON '
sql_2 = sql_2 + 't.emp_no = s.emp_no '
sql_2 = sql_2 + 'GROUP BY 1 '
sql_2 = sql_2 + 'ORDER BY 1 ASC;'

avg_data = pd.read_sql(sql_2,conn)

avg_df = pd.DataFrame(avg_data)

avg_df

                title  average salary
0  Assistant Engineer        48493.20
1            Engineer        48539.78
2             Manager        51531.04
3     Senior Engineer        48506.75
4        Senior Staff        58503.29
5               Staff        58465.27
6    Technique Leader        48580.51